#pragma once
#include "book.h"


//book对象的部分初始化
Book book[Max_BookCategory]=
{
	Book("9787302397519",1, "C语言其实很简单", "张宁", "清华大学出版社", 2015, 3, 59.80),
	Book("9787121411748",6,"计算机网络(第8版)","谢希仁","电子工业出版社",2021,6,59.30),
	Book("9787109291287",2,"高等数学辅导讲义","武忠祥","中国农业出版社",2022,10,69.80),
	Book("9787302481447",20,"C程序设计(第5版)","谭浩强","清华大学出版社",2017,30,49.00),
	Book("9787040118407",3, "大学物理学（第2版）", "卢德馨", "高等教育出版社",2003,6,46.60),
	Book("9787030394613",7, "量子力学(第5版)", "曾谨言", "科学出版社",2013 ,1, 178.00),
	Book("9787576030372",5 , "大学语文 ", "字如祥", "华东师范大学出版社", 2008,8,45.00),
	Book("9787569263947",8 , "童年", "高尔基", "吉林大学出版社", 2020,9,28.80),
	Book("9787122363930",10 , "光学探针与传感分析", "马会民", "中国科大出版社",2020,6,198.00),
	Book("9787122118172",11, "化验员必备知识与技能", "曾鸽鸣", "化学工业出版社",2011,10,58.00),
	Book("9877544004944",62	,"空气动力学与航空工业",	"李成智",	"山西教育出版社",	2012,	32	,71.20),
	Book("9787457277273",67	,"空气动力学",	"雷娟棉",	"北京理工大学出版社"	,2016	,22	,55.00),
	Book("9787324328407",78	,"赛车空气动力学",	"约瑟夫·卡茨",	"机械工业出版社"	,2019,	12	,60.00),
	Book("9787236476374",75	,"高等空气动力学",	"王振清",	"哈尔滨工程大学出版社"	,2010,	3	,35.00),
	Book("9787347537584",90	,"高速空气动力学",	"曹毅风","机械工业出版社"	,1988	,2	,7.00),
	Book("9787848358375",86	,"列车空气动力学",	"田红旗",	"中国铁道出版社"	,2007	,4	,77.00),
	Book("9787236473742",76	,"物理"	,"于战营",	"吉林大学出版社"	,2017	,24	,54.00),
	Book("9787326747545",89	,"黑洞"	,"王莹译",	"天津人民出版社"	,2019,	56	,45.00),
	Book("9787432677673",77	,"时间简史",	"史蒂芬·霍金"	,"湖南科学技术出版社"	,2016,	8,	56.00),
	Book("9787437247384",99	,"相对论",	"阿尔伯特·爱因斯坦",	"广东科学技术出版社"	,2020,	32,	67.00),
};

int Record_BookNumber = 20;//记录已经录入系统的书本的数目(包括已删除和未删除的书目类型数量)
